src/Enums/ВидыЦенностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыЦенностей</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвансыПолученные</Name>
					<Comment>для учета НДС, исчисленного с полученных авансов, кроме НДС с авансов под будущие поставки с 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыПолученные0</Name>
					<Comment>для учета НДС с авансов, полученных под будущие поставки с применением ставки 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентАренда</Name>
					<Comment>для учета сумм НДС, удержанных при аренде имущества у государственных и муниципальных органов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентИностранцы</Name>
					<Comment>для учета сумм НДС, удержанных с иностранцев, не состоящих на налоговом учете в РФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПосредническиеУслуги</Name>
					<Comment>Посреднические услуги оказываемые в интересах другого лица на основе договоров поручения, комиссии либо агентских договоров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРаботыИУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможенныеПлатежи</Name>
					<Comment>для учета НДС, уплаченного налогоплательщиком при ввозе на территорию России товаров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентКомитент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
					<Comment>Для учета НДС, по возвращаемым от покупателя (поставщику) ценностям</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыВыданные</Name>
					<Comment>для учета НДС, предъявленного по выданному авансу</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентРеализацияИмущества</Name>
					<Comment>для учета сумм НДС, удержанных при приобретении государственного и муниципального имущества</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыНесырьевые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиНеНаТерриторииРФ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыЦенностей/Ext/ManagerModule.bsl
// Возвращает массив видов ценностей, относящихся к операциям налогового агента по НДС.
// Параметры
//     ВключаяКомиссионныеОперации - Булево - признак необходимости включения в состав возвращаемого массива
//                                            операций реализации ценностей комитента-нерезидента.
// Возвращаемое значение: 
//     Массив - массив значений вида ПеречислениеСсылка.ВидыЦенностей.
Функция МассивВидовЦенностиНалоговыйАгент(ВключаяКомиссионныеОперации = Истина) Экспорт
	
	ВидыЦенностей = Новый Массив;
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентАренда);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентИностранцы);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентРеализацияИмущества);
	
	Если ВключаяКомиссионныеОперации Тогда
		ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентКомитент);
	КонецЕсли;
	
	Возврат ВидыЦенностей;
	
КонецФункции
